SET IDENTITY_INSERT Books ON

MERGE INTO [dbo].Books AS Target 
	USING (VALUES
	     (1, N'Наука и здравомыслие.Том 1', N'Альфред Коржибски', '1/1/1993', N'Английский', N'~/img/BookCover/Наука и здравомыслие. Том 1.png'),
		 (2, N'Наука и здравомыслие.Том 2', N'Альфред Коржибски', '1/1/1993', N'Русский', N'~/img/BookCover/Наука и здравомыслие. Том 2.jpg'),
		 (3, N'Руководство по управлению космическим кораблём Земля', N'Бакминстер Фулер', '1/1/1969', N'Русский', N'~/img/BookCover/Руководство по управлению космическим кораблём Земля.jpg'),
		 (4, N'Земля большой кристалл', N'Гончарова', '1/1/2005', N'Русский', N'~/img/BookCover/Земля большой кристалл.jpg'),
		 (5, N'Верните себе здравомыслие', N'Брюс и Сьюзан Кодиш', '1/1/2010', N'Русский', N'~/img/BookCover/Верните себе здравомыслие.jpg'),
		 (6, N'За пределами свободы и достоинства', N'Фредерик Скиннер', '1/1/1971', N'Русский', N'~/img/BookCover/За пределами свободы и достоинства.jpg'),    
		 (7, N'Язык в действии', N'Сэмюэл Хаякава', '1/1/1947', N'Русский', N'~/img/BookCover/Язык в действии.jpg'),
		 (8, N'Теория праздного класса', N'Торстейн Веблен', '1/1/1899', N'Русский', N'~/img/BookCover/Теория праздного класса.jpg'),
		 (9, N'Земля Фуллера. День с Баки и детьми', N'Бакминстер Фулер', '1/1/1983', N'Русский', N'~/img/BookCover/Земля Фуллера. День с Баки и детьми.jpg'),      
		 (10, N'Развёртвающееся значение', N'Дэвид Бом', '1/1/1985', N'Русский', N'~/img/BookCover/Развёртвающееся значение.jpg'), 
		 (11, N'О самом важном', N'Джидду Кришнамурти, Дэвид Бом', '1/1/1996', N'Русский', N'~/img/BookCover/О самом важном.jpg'), 
		 (12, N'Всё лучшее, что не купишь за деньги', N'Жак Фреско', '1/1/2002', N'Русский', N'~/img/BookCover/Всё лучшее, что не купишь за деньги.jpg'), 
		 (13, N'Взгляд в будущее', N'Жак Фреско, Кеннет Киз', '1/1/1969', N'Русский', N'~/img/BookCover/Взгляд в будущее.jpg'), 
		 (14, N'Война это просто рэкет', N'Смидли Батлер', '1/1/1935', N'Русский', N'~/img/BookCover/Война это просто рэкет.jpg'), 
		 (15, N'Маленькая книга о большой памяти', N'Лурия А.Р.', '1/1/1968', N'Русский', N'~/img/BookCover/Маленькая книга о большой памяти.jpg'),
		 (16, N'Язык и сознание', N'Лурия А.Р.', '1/1/1979', N'Русский', N'~/img/BookCover/Язык и сознание.jpg'),
		 (17, N'Тирания слов', N'Льюис Чейз', '1/1/1959', N'Русский', N'~/img/BookCover/Тирания слов.jpg'),	 
		 (18, N'100-000-000 морских свинок', N'Артур Каллет, Фредерик Шлинк', '1/1/1933', N'Русский', N'~/img/BookCover/100-000-000 морских свинок.jpg'),
		 (19, N'Анархономика', N'Копенгагенский институт иновационных исслдеований', '1/1/2011', N'Русский', N'~/img/BookCover/Анархономика.jpg'),
		 (20, N'История утопий', N'Льюис Мамфорд', '1/1/1922', N'Английский', N'~/img/BookCover/История утопий.jpg'),
		 (21, N'Становление разума', N'Джеймс Харви Робинсон', '1/1/1921', N'Русский', N'~/img/BookCover/Становление разума.jpg'),
		 (22, N'Наука и поведение человека', N'Беррес Скиннер', '1/1/1956', N'Русский', N'~/img/BookCover/Наука и поведение человека.jpg'),
		 (23, N'Не рычите на собаку', N'Прайор Карен', '1/1/1995', N'Русский', N'~/img/BookCover/Не рычите на собаку.jpg'))
	AS Source (Id, Name, Author, Date, Language, ImgUrl)     
	ON Target.Id = Source.Id 
WHEN MATCHED  THEN     
	UPDATE      
	SET
		[Name] = Source.Name,
		[Author] = Source.Author,
		[Date] = Source.Date,
		[Language] = Source.Language,
		[ImgUrl] = Source.ImgUrl
WHEN NOT MATCHED BY TARGET  THEN     
	INSERT (Id, [Name], [Author], [Date], [Language], [ImgUrl])     
	VALUES (Id, Name, Author, Date, Language, ImgUrl);
SET IDENTITY_INSERT Books OFF